Revit 2027 API
ColumnAttachment.AttachOffset Property
 The offset of the column attachment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double AttachOffset { get; set; }
Public Property AttachOffset As Double
	Get
	Set
public:
property double AttachOffset {
	double get ();
	void set (double value);
}
member AttachOffset : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for attachOffset must be no more than 30000 feet in absolute value.
See Also
Reference
ColumnAttachment Class
Autodesk.Revit.DB Namespace